# **Structured Query Language**

- is a `programming language` used for **managing** and **manipulating data** held in a relational database management system (RDBMS).
- specifically designed for interacting with databases. It allows you to perform various operations like **querying** data, **inserting** new records, **updating** existing records, and **deleting** records.

## Database Structures

- In SQL, data is stored in tables, which are organized into databases.
- Each table consists of **rows** and **columns**
- `Rows` represent individual record, `Columns` represent attributes or fields of those records

## Install ipython-sql package

In [1]:
%pip install ipython-sql

Requirement already satisfied: ipython-sql in ./venv/lib/python3.11/site-packages (0.5.0)
Requirement already satisfied: prettytable in ./venv/lib/python3.11/site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in ./venv/lib/python3.11/site-packages (from ipython-sql) (8.24.0)
Requirement already satisfied: sqlalchemy>=2.0 in ./venv/lib/python3.11/site-packages (from ipython-sql) (2.0.30)
Requirement already satisfied: sqlparse in ./venv/lib/python3.11/site-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in ./venv/lib/python3.11/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in ./venv/lib/python3.11/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in ./venv/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.0)
Requirement already satisfied: decorator in ./venv/lib/python3.11/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in ./venv/lib/python3.11/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in ./venv/lib/python3.11/site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in ./venv/lib/python3.11/site-packages (from ipython->ipython-sql) (3.0.45)
Requirement already satisfied: pygments>=2.4.0 in ./venv/lib/python3.11/site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in ./venv/lib/python3.11/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in ./venv/lib/python3.11/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: pexpect>4.3 in ./venv/lib/python3.11/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in ./venv/lib/python3.11/site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in ./venv/lib/python3.11/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in ./venv/lib/python3.11/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in ./venv/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in ./venv/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in ./venv/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

## Load the SQL Extension

In [2]:
%load_ext sql

## Create SQLite Database

In [5]:
%sql sqlite:///sample-database.db

## Create Table

Syntax:
```
%%sql CREATE TABLE IF NOT EXISTS table-name (
    column1 data-type constraint,
    column2 data-type constraint,
    ...,
    columnN data-type constraint
);
```

In [30]:
%%sql
CREATE TABLE IF NOT EXISTS employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
);

 * sqlite:///sample-database.db
Done.

[]

### Check if the employee table is created successfully

In [31]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sample-database.db
Done.

[('employees',)]

### Check the structure of the table

Syntax:
```
%sql PRAGMA table_info('table-name');
```

In [32]:
%sql PRAGMA table_info('employees');

 * sqlite:///sample-database.db
Done.

[(0, 'employee_id', 'INT', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10, 2)', 1, None, 0)]

### Altering Table

Syntax:
```
%%sql ALTER TABLE table-name
ADD column-name data-type;
```

In [33]:
%%sql ALTER TABLE employees
ADD hire_date DATE;

 * sqlite:///sample-database.db
Done.

[]

In [34]:
%%sql ALTER TABLE employees
ADD performance_rating INT;

 * sqlite:///sample-database.db
Done.

[]

#### Check the structure of the table

In [35]:
%sql PRAGMA table_info('employees');

 * sqlite:///sample-database.db
Done.

[(0, 'employee_id', 'INT', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10, 2)', 1, None, 0),
 (5, 'hire_date', 'DATE', 0, None, 0),
 (6, 'performance_rating', 'INT', 0, None, 0)]

## Inserting Data

Syntax:
```
%%sql
INSERT INTO table-name (column1, column2, ..., columnN) 
VALUES (value1, value2, ..., valueN);
```

In [36]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (1, 'John', 'Doe', 'Sales', 50000.00, '2024-05-30', 3);

 * sqlite:///sample-database.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Selecting Data

Syntax:
```
%sql SELECT * FROM table-name;
```

In [38]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-05-30', 3),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-25', 4),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-26', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-27', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1)]

### Select Specific Columns

Syntax:
```
%%sql SELECT column1, column2, ..., columnN 
FROM table-name;
```

In [39]:
%%sql SELECT first_name, last_name, department
FROM employees;

 * sqlite:///sample-database.db
Done.

[('John', 'Doe', 'Sales'),
 ('Jane', 'Smith', 'Marketing'),
 ('Michael', 'Johnson', 'Sales'),
 ('Emily', 'Davis', 'Operations'),
 ('David', 'Wilson', 'Operations')]

## Update Data

Syntax:
```
UPDATE table-name 
SET column-name = new-data 
WHERE primary-key = value;
```

In [40]:
%%sql UPDATE employees
SET salary = 55000.00
WHERE employee_id = 1;

 * sqlite:///sample-database.db
1 rows affected.

[]

In [23]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 55000, '2024-05-30', 3)]

#### Inserting more data

In [24]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (2, 'Jane', 'Smith', 'Marketing', 55000.00, '2024-04-25', 4),
       (3, 'Michael', 'Johnson', 'Sales', 60000.00, '2024-04-26', 5),
       (4, 'Emily', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
       (5, 'David', 'Wilson', 'Operations', 58000.00, '2024-04-28', 1);

 * sqlite:///sample-database.db
4 rows affected.

[]

Selecting all data to confirm if successful:

In [25]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 55000, '2024-05-30', 3),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-25', 4),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-26', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-27', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1)]

## Deleting Data

Syntax:
```
DELETE FROM table-name
WHERE primary-key = value;
```

In [26]:
%%sql DELETE FROM employees
WHERE employee_id = 4;

 * sqlite:///sample-database.db
1 rows affected.

[]

 Selecting all data to confirm if successful:

In [27]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 55000, '2024-05-30', 3),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-25', 4),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-26', 5),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1)]

## Deleting Table

Syntax:
```
%sql DROP TABLE table-name;
```

In [43]:
%sql DROP TABLE employees;

 * sqlite:///sample-database.db
Done.

[]

 Check the name of tables in the database:

In [44]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sample-database.db
Done.

[]

To retrieve employee records from the employees table where the first_name column contains the substring "jo":

In [42]:
%%sql SELECT * FROM employees
WHERE first_name LIKE '%jo%'

 * sqlite:///sample-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 55000, '2024-05-30', 3)]